; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v1 - type_1 ?v8 - type_3)
 	      (pred_2 ?v3 - object ?v8 - type_3)
	      (pred_3 ?v1 - type_1 ?v7 - type_2)
	      (pred_1 ?v1 - type_1 ?v3 - object ?v7 - type_2))

   (:action op_3
       :parameters  (?v1 - type_1 ?v5 ?v2 - type_3)
       :precondition (and  (pred_4 ?v1 ?v5))
       :effect (and  (pred_4 ?v1 ?v2)
		     (not (pred_4 ?v1 ?v5))))

   (:action op_2
       :parameters (?v1 - type_1 ?v4 - object ?v6 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_2 ?v4 ?v6) (pred_4 ?v1 ?v6) (pred_3 ?v1 ?v7))
       :effect (and (pred_1 ?v1 ?v4 ?v7)
		    (not (pred_2 ?v4 ?v6)) 
		    (not (pred_3 ?v1 ?v7))))

   (:action op_1
       :parameters (?v1 - type_1 ?v4 - object ?v6 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v4 ?v7) (pred_4 ?v1 ?v6))
       :effect (and (pred_2 ?v4 ?v6)
		    (pred_3 ?v1 ?v7)
		    (not (pred_1 ?v1 ?v4 ?v7)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_09 obj_07 - type_1
obj_11 obj_01 obj_02 obj_03 - type_2
obj_05 obj_12 obj_06 obj_04 - type_3
obj_08 obj_13 obj_10 - object)
(:init
(pred_4 obj_09 obj_12)
(pred_3 obj_09 obj_11)
(pred_3 obj_09 obj_01)
(pred_4 obj_07 obj_04)
(pred_3 obj_07 obj_02)
(pred_3 obj_07 obj_03)
(pred_2 obj_08 obj_05)
(pred_2 obj_13 obj_04)
(pred_2 obj_10 obj_12)
)
(:goal
(and
(pred_2 obj_08 obj_04)
(pred_2 obj_13 obj_04)
(pred_2 obj_10 obj_05)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_09 obj_05) (pred_4 obj_07 obj_05))))
  )
)
)

; plan
1. (op_2 obj_09 obj_10 obj_12 obj_01)
   deleted: (pred_2 obj_10 obj_12) (pred_3 obj_09 obj_01)
   added: (pred_1 obj_09 obj_10 obj_01)
   goals met: 1 of 3
2. (op_3 obj_09 obj_12 obj_05)
   deleted: (pred_4 obj_09 obj_12)
   added: (pred_4 obj_09 obj_05)
   goals met: 1 of 3
3. (op_1 obj_09 obj_10 obj_05 obj_01)
   deleted: (pred_1 obj_09 obj_10 obj_01)
   added: (pred_2 obj_10 obj_05) (pred_3 obj_09 obj_01)
   goals met: 2 of 3
4. (op_2 obj_09 obj_08 obj_05 obj_01)
   deleted: (pred_2 obj_08 obj_05) (pred_3 obj_09 obj_01)
   added: (pred_1 obj_09 obj_08 obj_01)
   goals met: 2 of 3
5. (op_3 obj_09 obj_05 obj_04)
   deleted: (pred_4 obj_09 obj_05)
   added: (pred_4 obj_09 obj_04)
   goals met: 2 of 3
6. (op_1 obj_09 obj_08 obj_04 obj_01)
   deleted: (pred_1 obj_09 obj_08 obj_01)
   added: (pred_2 obj_08 obj_04) (pred_3 obj_09 obj_01)
   goals met: 3 of 3
